
[
    {
        "image" : "how-to-draw-spiderman-1",
        "text" : "Begin by drawing a small circle. This will become Spider-Man's head."
    },
    {
        "image" : "how-to-draw-spiderman-2",
        "text" : "Draw a curved line below the circle, attached to it on each side. This outlines Spider-Man's jaw."
    },
    
    {
        "image" : "how-to-draw-spiderman-3",
        "text" : "Draw a curved line down the center of the face. This will serve as a guide to placing other features."
    },
    
    {
        "image" : "how-to-draw-spiderman-4",
        "text" : "Extend two short lines below the head to form the neck. Connect them at the bottom using a curved line."
    },
    
    {
        "image" : "how-to-draw-spiderman-5",
        "text" : "Extend curved lines from the sides of the neck, and connect them below the neck using a pair of curved lines. This should outline a bent diamond shape, forming the tops of the shoulders."
    },
    
    {
        "image" : "how-to-draw-spiderman-6",
        "text" : "Draw a long curved line from each side of the shoulders to outline the sides of the torso. Connect them at the bottom using two short lines that meet at a point. Then, draw a curved line across the chest."
    },
    
    {
        "image" : "how-to-draw-spiderman-7",
        "text" : "Draw curved lines overlapping the shoulders and torso on each side. These will guide you in finishing the shoulders and drawing the tops of the arms. Extend curved lines from the bottom of the torso and connect them with a long curved line."
    },
    
    {
        "image" : "how-to-draw-spiderman-8",
        "text" : "Draw an oval overlapping each of the shoulder circles to form the upper arm. Then, draw an oval overlapping each upper arm to indicate the lower arm. Draw two large ovals overlapping the bottom of the torso to form the upper legs."
    },
    
    {
        "image" : "how-to-draw-spiderman-9",
        "text" : "Enclose an irregular shape at the end of each arm to form the hands. Draw a curved line across each hand, distinguishing the back of the hands from the curled fingers of the fist. Then, draw small circles overlapping the bottoms of the upper legs to form the knees. Finally, draw an oval overlapping each knee to indicate the lower legs."
    },
    
    {
        "image" : "how-to-draw-spiderman-10",
        "text" : "Draw a curved line across each oval of the lower legs. From the ends of that line, extend a pair of lines and connect them at the bottom. This outlines Spider-Man's boots."
    },
    
    {
        "image" : "how-to-draw-spiderman-11",
        "text" : "Begin to detail your character. Start with Spider-Man's face. Using the vertical line as a guide, draw the eye patches. For each, enclose a teardrop shape within a teardrop shape."
    },
    
    {
        "image" : "how-to-draw-spiderman-12",
        "text" : "Begin erasing guide lines from the head, arms, torso, and legs."
    },
    
    {
        "image" : "how-to-draw-spiderman-13",
        "text" : "Use curved lines to contour and smooth out the outlines of the arms, legs, and hands. Use additional lines to enclose the panels of blue cloth on the sides of the torso."
    },
    
    {
        "image" : "how-to-draw-spiderman-14",
        "text" : " Use curved lines to contour and enhance the detail of the boot outlines. Draw a curved line across each of the lower arms to indicate the tops of the gloves."
    },
    
    {
        "image" : "how-to-draw-spiderman-15",
        "text" : "Erase the guide lines from your character, leaving a clean outline. Notice how the remnants of the original shapes lend themselves to the appearance of bulging muscles."
    },
    
    {
        "image" : "how-to-draw-spiderman-16",
        "text" : "Use curved lines to contour the elbows, knees, collar bones, and ribs"
    },
    
    {
        "image" : "how-to-draw-spiderman-17",
        "text" : "Draw long, curved, vertical lines across the face, neck, torso, gloves, and boots. These stripes are the beginning of Spidey's iconic spider web pattern."
    },
    
    {
        "image" : "how-to-draw-spiderman-18",
        "text" : "Draw rows of curved lines between the vertical lines, completing the appearance of the spider web."
    },
    
    {
        "image" : "how-to-draw-spiderman-19",
        "text" : "Shade a series of ovals and curved lines on Spider-Man's chest to form the Spider-Man logo."
    },
    
    {
        "image" : "how-to-draw-spiderman-20",
        "text" : "Color your cartoon of your Friendly Neighborhood Spider-Man. His suit is typically red and blue - red head, torso, gloves and boots, and blue arms and legs. With great drawing skills comes great responsibility... "
    },
    {
        "image" : "how-to-draw-spiderman-21",
        "text" : "Color your cartoon of your Friendly Neighborhood Spider-Man. His suit is typically red and blue - red head, torso, gloves and boots, and blue arms and legs. With great drawing skills comes great responsibility... "
    },
    

]
