
[
    
    {
        "text" : "INTRODUCTION",
    },
    
    {
        "text" : "The type of eyes a character has can tell us a lot about their personality. The main focal point is the outer tip of the eyes. So here, we will look at how to draw standard narrow sharp-eyes.\n\nCharacters with sharp eyes are usually those who are more cool, independent, strong-headed, mature, serious, or mysterious. They are not usually used for quiet, cute, and shy types. However, that's not a rule!",
    },
    
    {
        "text" : "\nSTEP 1: OUTLINE - SHAPE AND SIZE",
    },
    
    {
        "image" : "LR1_grande",
        "width" : 600,
        "height" : 163,
    },
    
    {
        "text" : "First, we have to decide on the size and shape of the eyes. Here, I will draw moderately narrow eyes that slant upward. I start by drawing the upper lines at an angle to determine the outer tip of the eyes. You can see how the middle of the eyes curved a little (refer to the ORANGE lines below). Depending on your design, this can be flat or downward sloping. Second, I draw a slight curve at the outer tip of the upper lines, because while I want the eyes to be sharp, I still want a roundness to it (see ORANGE and GREEN lines below). But you can also make this area more angular (See 'Extra: Other Different Types' below).",
    },
    
    {
        "image" : "LR1b_large",
        "width" : 479,
        "height" : 142,
    },
    
    {
        "text" : "NOTE: Personally, I like to make the upper lines thicker than the ones at the bottom because they create an illusion of shadow which help create depth in the eyes. You can also see that I have drawn eye ducts and some extra lines around the eyes- this is an optional step depending on your style. You can also drawn them without such details.",
    },
    
    {
        "text" : "\nSTEP 2: OTHER FEATURES - BROWS AND CREASE",
    },
    
    {
        "image" : "LR2_8d395646-4d4a-4cb4-9a01-4149878b622d_grande",
        "width" : 599,
        "height" : 245,
    },
    
    {
        "text" : "This step requires you to think about the personality of the character and the design of the eyes. Do you want the brows to be thick or thin, short or regular size, round or flat? Here I have picked some simple eyebrows to show you.\n\nYou also have to decide if you want the character to have double eyelids or not. If yes, you can draw a thin line above the eyes. The higher this line is, the more bored or uninterested the eyes will look- so be careful with the height of the placement of this crease.",
    },
    
    {
        "text" : "\nSTEP 3: IRIS - COLOR AND STYLE",
    },
    
    {
        "image" : "LR4_b4ea4007-e11a-4cd1-9205-046c78a72522_grande",
        "width" : 599,
        "height" : 245,
    },
    
    {
        "text" : "To finish up the eyes, draw the pupil and the design of the iris in the eyes. The design inside the eyes is up to you, but here, I have drawn a simple design. To see some more ways to fill in the eyes, CLICK HERE to go to another eye tutorial.\n\nNOTE: I have also added some thickness to the other lines around the eyes while doing this step to create more depth to the lines. My main media is usually ink, whiteout, and screentone.\n\nYou can use the link below to download and print a blank eye template for practicing the iris details!",
    },
    
    {
        "text" : "\nSTEP 4: DEPTH - SHADING",
    },
    
    {
        "image" : "LR5_977b24b9-ad0f-4e44-8b65-079e5d71615d_grande",
        "width" : 599,
        "height" : 245,
    },
    
    {
        "text" : "I would say that this is the last step, but it's entirely optional. The shading here is not important. However, when you are trying to create a sort of effect where the light source is clear, or when you are drawing close up, shading can come in handy. Of course, when you are shading, you can use other media too, but I have used two shades of screentones. The more intense the light, the more contrast there should be between the shadings. The stronger the light exposer, the darker the shadow becomes.",
    },
    
    {
        "text" : "\nEXTRA: OTHER DIFFERENT TYPES\n\nThere are other types of sharp eyes that you can draw too! Make changes to the overall size and shape of the eyes to make those characters look different! Here are a couple examples:",
    },
    
    {
        "image" : "LR6a_grande",
        "width" : 599,
        "height" : 344,
    },
    
    {
        "text" : "PARALLELOGRAM\n\nThese eyes are a little different from the previous ones that I’ve drawn. You can see that these are larger and more angular, as indicated by the GREEN lines. Although there is a slight curve to the lines, you can see that the one eye is almost in the shape of a perfect parallelogram, whereas the other one is more like a trapezium.",
    },
    
    {
        "image" : "LR6b_grande",
        "width" : 600,
        "height" : 343,
    },
    
    {
        "text" : "SEMI-CIRCLE\n\nHere, we have another sharp eye. However, you can see that even though I haven't drawn the outer corner of the eyes, you can still see the overall shape of it. These eyes are considered sharp and round-- angled semi circles. You might have probably noticed that the pupil here is triangular. This is not unusual! I picked this sharp iris because it seems to create more impact and personality.",
    },
    
    {
        "text" : "\nCONCLUSION\n\nI hope that this was helpful to you! Feel free to mix and match shapes to create all kinds of eye-designs for your characters! You can also download FREE BLANK EYES TEMPLATES BELOW. However, if you would like to learn how to draw more types of eyes, feel free to check out Koda Tadashi Sensei’s Ebook by clicking on the icon below!",
    },
    
]
