
[
    
    {
        "image" : "nose1b",
        "width" : 1242,
        "height" : 1044,
    },
    
    {
        "text" : "Anime- and manga-style noses and mouths are pretty straightforward, so rather than taking you through various styles step by step, I have several examples for you to use. Here is your basic anime- and manga-style nose and mouth. It consists of three basic simple shapes: a wedge for the nose, a long, thin line for the mouth, and a shorter line to define the lower lip (this lower line is not always included, though). In frontal views like this, you can get away with using very few lines to define the nose and mouth. The size and shape of each feature varies with each character. Always make sure the features line up; to help you line them up, draw vertical guidelines as shown. In the second picture, the face is turned to the side, but the features are still aligned along the curved guideline that represents the center of the face.",
    },
    
    {
        "image" : "nose1c",
        "width" : 1242,
        "height" : 890,
    },
    
    {
        "text" : "Drawing the nose and mouth for a profile is more difficult than drawing them from the front or at a 3/4 view. The main reason for this is because you can't get away with not defining the lips as much. ^_^ You have to draw them in, rather than using just simple straight lines. Despite the difficulty, if you get it right, it can look really nice. The main thing to consider is the curve of the nose, lips, and chin. The upper lip curves inward, and lower lip (which is slightly receded on the face) curves outward. It may take some practice before you can get it to look like the character isn't making a weird face or puckering their lips or anything like that. ^_~",
    },
    
    {
        "image" : "nose1d",
        "width" : 1242,
        "height" : 813,
    },
    
    {
        "text" : "The lower half of the face consists of a series of contrasting curves. Notice that how in both pictures, the nose curves in towards the face, then curves back slightly out right above the upper lip. The upper lip curves inward, and the lower lip curves outward. The chin is not just a straight line; it is round and curves outward.",
    },
    
    {
        "image" : "nose1a",
        "width" : 1242,
        "height" : 943,
    },
    
    {
        "text" : "Here is a selection of examples of different styles of mouths and noses. Several of these can be used for either gender, so I didn't bother separating them. ^_^ Notice that with some styles, the mouth is defined by only a thin, straight line, while with other styles, the lips are more well defined. Anime and manga mouths are not often very large, unless the character is yelling or shouting, so keep them relatively small. The noses vary quite a lot, as well; some are drawn as wedges, some are defined solely with shading, and some are detailed enough that you can see the nostrils. Female characters will tend to have smaller, less defined noses, while male characters will often have longer, angular noses.",
    },
    
    {
        "image" : "nose1e",
        "width" : 1242,
        "height" : 563,
    },
    
    {
        "text" : "Here are some more examples of noses and mouths, drawn at a profile. Even though the proportions and expressions change, they all stick to the same basic shape as mentioned above. When drawing faces at this angle, be careful not to make the noses really pointy and the face too flat. Make sure the features curve properly, or the face is not going to turn out looking right.",
    },
    
]
