[
    {
        "image" : "draw-monkey-d-luffy-1",
        "text" : "Start by drawing a big circle in the middle of the page. This will be the basic shape for the top part of Monkey D. Luffy's head. The circle doesn’t have to be perfect. It’s just a guide."
    },
    {
        "image" : "draw-monkey-d-luffy-2",
        "text" : "Draw a curved line under the circle as a guide for Monkey D. Luffy's chin and jaw. The line should have a small point near the middle for the chin. Together these two shapes form the guide for the head."
    },
    {
        "image" : "draw-monkey-d-luffy-3",
        "text" : " Next, draw two intersecting lines across the entire head, one vertical and one horizontal. Bend the lines so that they contour to the shape. These will be construction lines that will help you place Monkey D. Luffy's facial features later on."
    },
    {
        "image" : "draw-monkey-d-luffy-4",
        "text" : "Draw two small circles as guides for Monkey D. Luffy's eyes. Draw them sitting on top of the horizontal construction line and on either side of the vertical construction line. The circle on the right should be a bit smaller because of perspective."
    },
    {
        "image" : "draw-monkey-d-luffy-5",
        "text" : "On the left side of Monkey D. Luffy's head, draw a curved line similar to a backward letter C as a guide for the ear. The top of the C-shaped line should be placed at the end of the horizontal construction line on the left."
    },
    {
        "image" : "draw-monkey-d-luffy-6",
        "text" : "That’s it for the initial sketch! You have the basic shape of Monkey D. Luffy from the Manga and Anime One Piece. Now go in and tighten your drawing. From this point on, press harder with your pencil in order to get darker lines and a more defined sketch."
    },
    {
        "image" : "draw-monkey-d-luffy-7",
        "text" : " Use the initial circles as guides to draw Monkey D. Luffy's eyes. Darken the top and bottom parts of the shapes. Inside each eye, draw a big dot for the pupils."
    },
    {
        "image" : "draw-monkey-d-luffy-8",
        "text" : "Above each eye, draw a curved line for Monkey D. Luffy's eyebrows. Right where the construction lines intersect, draw the nose as a curved line with a pointy tip near the bottom. The nose should follow the path of the vertical construction line and should end just above the bottom edge of the main circle."
    },
    {
        "image" : "draw-monkey-d-luffy-9",
        "text" : "Draw Monkey D. Luffy's big open mouth inside the lower half of the head. Follow the path of the bottom edge of the main circle for the top line of the mouth. Then draw the bottom of the mouth using the bottom half of the head as a guide for the shape."
    },
    {
        "image" : "draw-monkey-d-luffy-10",
        "text" : "Inside the mouth, draw two curved lines, one at the top and one at the bottom. These make up Monkey D. Luffy's teeth. In between the teeth, draw a couple of smaller curved lines for the big tongue."
    },
    {
        "image" : "draw-monkey-d-luffy-11",
        "text" : "Use the C-shaped line on the left side as a guide to draw Monkey D. Luffy's ear. Follow the path of the guide as you darken the line for the shape of the ear. Draw a few curved lines within the shape for the inner ear structure."
    },
    {
        "image" : "draw-monkey-d-luffy-12",
        "text" : "Monkey D. Luffy's hat and hair can be tricky, so they're divided into a few parts. First draw the top part of the hat as a long curved line high above the eyes that has a diagonal orientation. Draw a few short spikes on the left end of the line that come down to the ear for the back part of the hair. Draw a couple of longer spikes on the right end of the line for the hair sticking out from under the hat."
    },
    {
        "image" : "draw-monkey-d-luffy-13",
        "text" : "On the left side of the face, draw a series of long curved spikes to represent the shaggy hair sticking out from under Monkey D. Luffy's hat. The hair clumps should cover part of the eyebrow and eye, and they should get shorter the closer they are to the ear."
    },
    {
        "image" : "draw-monkey-d-luffy-14",
        "text" : "Add more curved spikes on the right side of Monkey D. Luffy's face. These clumps of hair should be a little wider and should meet the spikes drawn in step 12."
    },
    {
        "image" : "draw-monkey-d-luffy-15",
        "text" : "Draw the rest of the face and neck using the initial lines as guides. Simply draw over the guides and darken the lines. Under the eye on the right, draw Monkey D. Luffy's scar using three small lines."
    },
    {
        "image" : "draw-monkey-d-luffy-16",
        "text" : "Now draw the brim of the hat as a long curved line. The line starts on the left side of Monkey D. Luffy's head and moves to the left before curving up toward the top of the main circle. Then it curves back down to the right and in toward the head again. As you draw the line, give it a few extra smaller lines along the way to make it seem like an old, used straw hat"
    },
    {
        "image" : "draw-monkey-d-luffy-17",
        "text" : "Now draw the top part of Monkey D. Luffy's hat by draw a long, curved, dome-like line above the head. Draw a line on the left side between the brim and the top for the band around it. Draw a few more shorter lines throughout for the straw hat texture."
    },
    {
        "image" : "draw-monkey-d-luffy-18",
        "text" : "That’s it! You now have a nice sketch of Monkey D. Luffy. You can stop at this quick drawing for a rough, sketchy look or go for a more finished look by continuing to the step below."
    },
    {
        "image" : "draw-monkey-d-luffy-19",
        "text" : "For a more finished, inked look, carefully draw over the final sketch lines with a pen or marker. Wait for the ink to dry, and then get rid of every pencil mark with an eraser. You now have a finished inked drawing of Monkey D. Luffy! You can stop here or go to the final step to complete your Luffy drawing."
    },
    {
        "image" : "draw-monkey-d-luffy-last",
        "text" : "For a completely finished Monkey D. Luffy drawing, you have to color it. You can use markers, color pencils or even crayons! Color his hat yellow and the hat's band red. His hair should be black. The skin should be peach, but if you don't have peach, improvise and use light brown or yellow-orange. The sides of his mouth should be brown and the tongue pink. That’s it! You now have a completed drawing of Monkey D. Luffy from the Manga and Anime One Piece."
    },
    
    
]
