[
    {
        "image" : "how_draw_roronoa-zoro_one_piece_01",
        "text" : "As always all the blue and green lines are just construction lines and will be erased later so do not push on your pencil too much ^_^ I will try to be super efficient with text so will only describe steps that require some explanation.\nMake sure to leave enough free space on paper for next steps. You can see how much space you will need from the size of the paper on this picture."
    },
    {
        "image" : "how_draw_roronoa-zoro_one_piece_02",
        "text" : ""
    },
    {
        "image" : "how_draw_roronoa-zoro_one_piece_03",
        "text" : ""
    },
    {
        "image" : "how_draw_roronoa-zoro_one_piece_04",
        "text" : ""
    },
    {
        "image" : "how_draw_roronoa-zoro_one_piece_05",
        "text" : ""
    },
    {
        "image" : "how_draw_roronoa-zoro_one_piece_06",
        "text" : ""
    },
    {
        "image" : "how_draw_roronoa-zoro_one_piece_07",
        "text" : ""
    },
    {
        "image" : "how_draw_roronoa-zoro_one_piece_08",
        "text" : ""
    },
    {
        "image" : "how_draw_roronoa-zoro_one_piece_09",
        "text" : "Lighten all the construction lines by “stamping” the kneedable eraser on paper. Make sure to refer to the picture above as you need to ink only some parts of the construction lines. There are also some new lines so better sketch them in pencil first ^_^."
    },
    {
        "image" : "how_draw_roronoa-zoro_one_piece_10",
        "text" : "Wait till the ink is nice and dry and erase all the construction lines."
    },
    {
        "image" : "how_draw_roronoa-zoro_one_piece_11",
        "text" : "To add colors, make sure to sketch the color outlines with the right color or pencil first.\nIf your goal is to become a real Mangaka and design your own manga characters make sure to try to draw Roronoa Zoro from memory several times. Always compare the drawing to the original and correct any mistakes you see. Do this till you are happy with the result. It doesn’t have to look exactly the same, don’t sweat the details. The point is that you get the main shapes right and that it looks good. This is the best way to build a huge library of manga shapes in your memory that you can use to draw and design your own manga characters ^_-.\nDraw with passion! ^_^"
    }
]
