
[
    {
        "image" : "How-to-draw-Iron-Man-1",
        "text" : "Specify the pose of the character by starting with a stick figure."
    },
    {
        "image" : "How-to-draw-Iron-Man-2",
        "text" : "The basic forms of the Iron Man Suit are still based on the basic human form. To make it easier to construct, you should think about the basic shapes of the most important parts of the human body. Think of three-dimensional cylinders and cubes.
        
"
    },
    {
        "image" : "How-to-draw-Iron-Man-3",
        "text" : "Fine-tune the construction lines until they provide the right combination of cylinders, boxes and planes that make up the pieces of Iron Man’s armored suit.\nNote: It is very important to create the initial shape correctly before continuing to draw Iron Man. This is the only way to lay the foundation to draw the more complex details in the correct proportion."
    },
    {
        "image" : "How-to-draw-Iron-Man-4",
        "text" : "Now it is important to have a detailed reference image. Take a look at some pictures of Iron Man or print one of the animations to reproduce the exact details of the armor in your drawing.\nWhen drawing the Iron Man helmet, you have to pay special attention to the visor that Tony Stark can shut down."
    },
    {
        "image" : "How-to-draw-Iron-Man-5",
        "text" : "The breastplate houses the centerpiece of the Iron Man armor: the arc reactor, which Stark developed to supply all the power for his suit. This reactor is located centrally on the breastplate."
    },
    {
        "image" : "How-to-draw-Iron-Man-6",
        "text" : "Now finish the Iron Man torso. Watch out for the Repulsors on the palms, which allow the superhero to maneuver and attack. The abdominal and lumbar armor consists of individual flexible links to keep Iron Man mobile despite heavy armor."
    },
    {
        "image" : "How-to-draw-Iron-Man-7",
        "text" : "If you want to draw the legs of Iron Man, pay attention to the joint areas of the knee and ankle. The components of the armor are flexible in these areas and support the functions of the human joints."
    },
    {
        "image" : "How-to-draw-Iron-Man-8",
        "text" : "Refine the outline drawing and erase the help lines. Vary the line width and add some shading at this stage of the process."
    },
    {
        "image" : "How-to-draw-Iron-Man-9",
        "text" : "Finally, you can add a little color to Iron Man. His basic color palette consists of red, gold, silver and white. If you work digitally, you can enhance the colours even further and give them a metallic effect."
    },
    {
        "image" : "How-to-draw-Iron-Man-10",
        "text" : "Finally, you can add a little color to Iron Man. His basic color palette consists of red, gold, silver and white. If you work digitally, you can enhance the colours even further and give them a metallic effect."
    },
    
]
