[

    {
        "image" : "fbody1",
        "width" : 1242,
        "height" : 1927,
    },
    
    {
        "text" : "I am going to begin this tutorial by addressing one of the most common requests that I receive: how to draw women's breasts (heh, I never thought I'd actually be making a tutorial about this.... ^_^). One of the most important things you should consider is to make your subject look natural; you can draw an attractive female without making her look like a 'silicon implant ad,' as a friend of mine put it. ^_^\nThe main problems people seem to have with drawing breasts are the shape and the placement. A lot of artists (professionals as well as amatuers) make them look like balloons that have been taped onto the subject's chest; this is hardly a natural look. If you look through figure drawing books, you'll see that they are more like halves of a sphere or overturned teacups rather than balloons.\nNow, note the position. Imagine a central guideline that runs down the center of your subject's body, as shown at the left. The breasts are at 45 degree angles from that center line, and are about halfway down the chest (shown by the red diagonal guidelines). Be very careful not to draw them too close together or too far apart, or too high on the chest; these are commonly made mistakes. As you will see in examples below, this basic rule of the 45 degree placement will apply to pretty much whatever pose you are using.",
    },
    
    {
        "image" : "fbody2",
        "width" : 1242,
        "height" : 1516,
    },
    
    {
        "text" : "Here is another pose, showing the torso from a front view. Note how the breasts are still located at 45 degree angles from the center line of the body. Oh, also take note of the shading. After looking at various examples, I find that shading in this fashion (rather than just following the lower curves as you would shade a sphere) makes them look more natural.",
    },
    
    {
        "image" : "fbody3",
        "width" : 1138,
        "height" : 2048,
    },
    
    {
        "text" : "Here is one last pose to go over the size and placement. It's harder to see here, but the breasts are still at the 45 degree angle from the center line (which isn't drawn in this picture; sorry about that ^_^;). Notice that the leftmost breast is drawn as a half-sphere, not as a full sphere. If you want to exaggerate the size, that's your choice, but I personally don't think its necessary.",
    },
    
    {
        "image" : "fbody4",
        "width" : 1242,
        "height" : 899,
    },
    
    {
        "text" : "Now, lets move on to the neck and shoulders. When you draw the shoulders, notice that they are slope down smoothly, they aren't flat. Try to take the musculature structure of the neck and shoulders into consideration, especially if you are going for a more realistic look. They should be shaped more like a clothes hanger, and not drawn flat and hard.",
    },
    
    {
        "image" : "fbody5",
        "width" : 1242,
        "height" : 1000,
    },
    
    {
        "text" : "Here are some more examples of various shoulder positions. Notice that the shoulders are never drawn flat and dull.",
    },
    
    {
        "image" : "fbody6",
        "width" : 1252,
        "height" : 1669,
    },
    
    {
        "text" : "One more thing I wanted to cover regarding the torso is how to draw it if an arm is lifted. ^_^ I have personally found this difficult sometimes, so I figured it was a good thing to go over. If the arm is lifted, then the back of the torso will be exposed. Although a female's torso isn't as round and full as a males, it should still stick out in the back. Don't make the upper torso too narrow. Notice also how the top of the right-most breast doesn't just keep curving inwards in a circle; remember that it is not a full sphere, so it is attached to the muscles of the shoulder.",
    },
    
    {
        "image" : "fbody7",
        "width" : 1242,
        "height" : 1710,
    },
    
    {
        "text" : "Next, let's move on to the arms. The arms consist of three basic sections: the upper arm, the foream, and the hand. Each can be represented in preliminary sketches by oval shapes. Now, I know some people don't like using the shapes; you do not have to do it this way, this is just one possible way to go about sketching arms. Some books recommend using cylinders, but it's better to use flat ovals because they more closely match the shape of the arm. It isn't shown here, but if the arms are held loosely at the side, the hands should come down to the middle of the thigh. The elbows should be at about waist length.",
    },
    
    {
        "image" : "fbody8",
        "width" : 1191,
        "height" : 2048,
    },
    
    {
        "text" : "Once you have your basic shapes of the arms down, you can refine them and make them look more realistic. This is a little more difficult. ^_^ When drawing the arms, don't make them straight and flat; arms have muscles, after all. ^_^ Never draw a straight arm as just a long cylinder (unless you are doing a super-deformed/chibi pic). ^_^ The arm starts at the shoulder. Notice how the shoulder bulges out slightly, then curves back down. The arm tapers slightly inwards until you reach the elbow.\nAt the elbow, the arm widens again just after the elbow where the biceps are (as shown in the topmost picture here). The elbow itself can be a little daunting to draw. Remember that the arm doesn't just start curving in the other direction; there is a joint, and it should be shown (as in the top and bottom left pic). There are more examples below.",
    },
    
    {
        "image" : "fbody9",
        "width" : 1242,
        "height" : 752,
    },
    
    {
        "text" : "Here are some more poses for arms, this time showing how the parts of the arm overlap. It is sometimes easier to visualize the overlapping or foreshortening if you use basic oval shapes first, but again, you do not have to use them if you do not want to. Notice how in the topmost picture, the arm that is moving away from us tapers and grows smaller the further away from us it is.",
    },
    
    {
        "image" : "fbody10",
        "width" : 1242,
        "height" : 921,
    },
    
    {
        "text" : "These poses are a little more difficult to refine. It is very important that you pay close attention to the way each part of the arm is facing, and how the elbow is to be positioned. Try to imagine the arm as two different shapes stuck together: the cylindrical upper arm, and the forearm, which is sort of shaped like a bowling pin with a bump on the bottom. ^_^ That should help you in determining the position of the elbow.",
    },
    
    {
        "image" : "fbody11",
        "width" : 1242,
        "height" : 1609,
    },
    
    {
        "text" : "Legs can be another problem area for artists. It's hard to make them shaped properly (especially when you don't practice very much, like me... ^_^;) Just like with the arms, it is important not to make them perfectly straight like cylinders. It is especially helpful to use ovals to help you get the shape right rather than cylinders, because the ovals better suit the shape of the thighs and calves. The upper part of each leg should be thicker, rounder, and shorter than the lower part of leg. When drawing the legs, start them thicker at the top, then taper them down until the reach the knee. As with the elbow on the previous page, the knee should be defined; it's a joint and should be drawn, the leg isn't made of rubber. ^_^ Notice how the knee bulges outwards slightly; the leg doesn't just go straight down. The muscles on the lower leg, especially the calves, should protrude a little.",
    },
    
    {
        "image" : "fbody12",
        "width" : 1242,
        "height" : 2004,
    },
    
    {
        "text" : "Here are some more poses. I didn't use the preliminary ovals this time because I forgot, but you should be able to see the oval shapes of the various parts of the legs. Again, I would like to bring attention to the knee, especially in the lower pictures.\nWhen the leg is bent, the knee can be drawn like a flat plane. I shaded these legs to help give you a better idea of their form. There are better details on this in various figure drawing books, but since you don't often see every bone and muscle on an anime character, I didn't feel the need to go over everything. ^_^\nOn the picture to the right, notice how the calves obscure part of the thigh. In the left picture, notice that the lower part of the legs that are lifted up are not visible, since they are hidden behind the rest of the leg.",
    },
    
    {
        "image" : "fbody13",
        "width" : 1242,
        "height" : 1384,
    },
    
    {
        "text" : "Well, just as its important to be able to draw someone from the front, you may also wish to draw them from behind. In which case, it helps to know how to actually draw someone's behind. ^_^ I wasn't going to add this, but since many anime girls are draw in skin tight suits or swimsuits, it's kind of important. Umm... I don't know quite what to say; just be careful how you make the legs connect to the rest of the body. There's more info in the next section of this tutorial. If you need extra reference, get that figure drawing book by Burne Hogarth mentioned in my recommended reading section. He has several pages devoted to the subject. -_^",
    },
    
    {
        "image" : "fbody14",
        "width" : 1242,
        "height" : 1442,
    },
    
    {
        "text" : "All right, now that we've gone over the major areas in detail, lets put them all together and make a full body pose. :) When drawing your subject, you can either begin with the prelimiary ovals and circles, or you can go straight to the final draft, whichever you are most comforable with. If you are using circles and ovals, then you will notice that the main body (torso and pelvis) are composed of two basic shapes, both of which curve inwards towards the stomach. I'm not going to go over these a lot, because they have been well documented in other figure drawing tutorials. ^_^ Make sure that both of these shapes, as well as the head, are aligned along a central guideline (as shown). This guideline is pretty much the spine of the character, and will determine the pose she is going to be in. Notice here that the center line curves to the left a little on the pelvis; this is because her weight is shifted and her left hip sticks out slightly (which makes the pose a little more interesting than if her weight is evenly balanced). The body can be equally divided in half as shown by the red guidelines. You can use that as a general reference when determining how long the legs should be in proportion to the rest of the body, but often times in anime the length of the legs is exaggerated, for both males and females, and it looks just fine.\nWhen drawing the midsection, remember to try to keep the hourglass figure shape. Female anime characters will generally have thin shoulders, a thin stomach, and a somewhat round waist. Be careful to make the curves look natural, unless you are really good at figure drawing and can exaggerate the proportions.",
    },
    
    {
        "image" : "fbody15",
        "width" : 1242,
        "height" : 1442,
    },
    
    {
        "text" : "Here is a similar pose, this time shown at a side angle. I have found side views to be difficult, since I had a hard time finding decent reference pictures. ^_^ Notice that the body is composed of the same basic shapes, except the shapes have been rotated around. One of the things you need to consider when drawing from this angle is the shape of the upper torso. It isn't shown very well here, but as you come straight down from the neck, the chest will stick out slightly at a sharp angle as you come to the collarbone. After that point, the torso is drawn at a smooth diagonal until you reach the hemisphere shape of the breasts (remember that they are half spheres; don't draw them like beach balls!) Beneath that, the torso continues to protrude outwards slightly until it reaches the bottom of what would be the ribcage (its a little over one headlength down from the shoulders). After the ribcage, curve back inwards a little for the stomach. Other things to look out for are the shape of the legs (the thighs round out in front, and are flatter in back, while the lower legs are just the opposite) and the subject's behind (make sure you don't exaggerate it too much).",
    },
    
    {
        "image" : "fbody16",
        "width" : 1242,
        "height" : 1442,
    },
    
    {
        "text" : "For the final pose of this tutorial, here is an example of someone drawn from behind (which you may actually need to draw at one point, especially if you are going to do manga ^_^). Just as before, the subject can be equally divided in half. Things to look out for at this angle include the neck; it connects up into the skull, and should obscure part of the face. The midsection should be somewhat hourglass shaped, but again, don't overexaggerate the curve unless you really know your anatomy (you have to know the basics before you can start bending the rules). Don't overdefine the lines on the behind, since there's little reason to do so. Be careful when drawing the arms; from the back, the elbows should be more prominent than usual. Check out the section on arms for more information.\nThat concludes the female figure drawing tutorial. I hope this gives you an understanding of basic anatomy, and helps you out when drawing full body subjects.",
    },


]
