[

    {
        "image" : "aid1139872-v4-728px-Draw-Simple-Anime-Eyes-Step-8",
        "width" : 1242,
        "height" : 1927,
    },
    
    {
        "text" : "Sketch the upper and lower lash lines. First, draw a horizontal line with a slight curve. Then, draw a line with a slight upward curve coming down off one end of the first line (the end that will be the outer corner of the eye) at a 45-degree angle. Make this line about 1/3 the length of the first line you drew. At this point, the upper lash line will have a C-shape, and you’ll be able to see the outer corner of the eye. To draw the lower lash line, draw a short, horizontal line with a slight curve centered under the upper lash line.[8]\nMale anime eyes are usually smaller and narrower than female anime eyes. The curves on the upper and lower lash lines should be slight so the eye doesn’t look too round.\nDraw the eyes about 1/8th the height of the head and 1/4th the width of the head, if you’re drawing one.",
    },
    
    {
        "image" : "aid1139872-v4-728px-Draw-Simple-Anime-Eyes-Step-9",
        "width" : 1242,
        "height" : 1516,
    },
    
    {
        "text" : "Draw an oval between the lash lines. Center the oval and make the top and bottom overlap with the lash lines so only part of the oval is visible. Make the width of the widest part of the oval about the same as the length of the lower lash line.[9]\nThis will be the iris.",
    },
    {
        "image" : "aid1139872-v4-728px-Draw-Simple-Anime-Eyes-Step-10",
        "width" : 1242,
        "height" : 899,
    },
    
    {
        "text" : "Add a small circle near the top of the oval. Draw the circle on the left or right side of the oval, near the top. It doesn’t matter which side, but place the circle on the same side in the second eye if you're drawing one. Make the circle about 1/10th the size of the iris.[10]\nYou’ll leave this circle white later on so it looks like light is reflecting off of the eye.",
    },
    
    {
        "image" : "aid1139872-v4-728px-Draw-Simple-Anime-Eyes-Step-11",
        "width" : 1242,
        "height" : 1000,
    },
    
    {
        "text" : "Make a smaller circle near the bottom of the oval on the opposite side. For example, if you drew the first circle on the top-right side of the oval, draw the smaller circle on the bottom-left side. Draw the circle so it’s about 1/2 the size of the first circle. This circle will also look like reflected light when you shade in your drawing.[11]",
    },
    
    {
        "image" : "aid1139872-v4-728px-Draw-Simple-Anime-Eyes-Step-12",
        "width" : 1252,
        "height" : 1669,
    },
    
    {
        "text" : "Draw a smaller oval inside the first one and fill it in to make the pupil. Center the oval inside the first one you drew, and make it about 1/4th the size. Shade it in with your pencil so it’s dark and completely filled in.[12]\nIf the oval overlaps with the small circles you drew, make sure the circles are in front of the oval. Whether or not the oval overlaps will depend on how big you made the circles.",
    },
    
    {
        "image" : "aid1139872-v4-728px-Draw-Simple-Anime-Eyes-Step-13",
        "width" : 1242,
        "height" : 1710,
    },
    
    {
        "text" : "Shade in the eye to finish your drawing. To shade in the eye, start by drawing a horizontal line from the left side of the oval to the right side. Then, shade everything above the line in so it’s the same color as the pupil. Shade everything below the line in a few shades lighter.[13]\nLeave the small circles you drew white.",
    },

]
