
[
    
    {
        "image" : "eyes1f",
        "width" : 1242,
        "height" : 828,
    },
    
    {
        "text" : "The eyes are among the most important features of anime and manga characters; they are — along with the mouth — the most expressive parts of the face, and are part of what makes each character different and recognizable. Thus, it is very important to be able to draw them correctly. In this section of the How to Draw Faces tutorial, we teach you how to draw a variety of anime- and manga-style eyes. Often, tutorials by other artists only show you how to draw large female eyes, without going over the large variety of other styles. Here, we'll cover both female and male eyes, plus give you examples of numerous other styles to help you develop your own characters, or to refine your style when drawing fan art.",
    },
    
    {
        "image" : "eyes1a",
        "width" : 1242,
        "height" : 828,
    },
    
    {
        "text" : "Let's begin with the most basic and common of anime and manga eyes, the large female type. Start off by drawing a line that curves upward, and is slightly thicker at the highest point. This eye will be on the right side of the face, so make the left end of the curved line higher than the right. The top of this particular eye isn't a perfect curve; it is slightly angular. Some eyes, of course, are nearly perfectly curved on the top.",
    },
    
    {
        "image" : "eyes1b",
        "width" : 1242,
        "height" : 864,
    },
    
    {
        "text" : "Next, draw in the lower part of the eye. To help you place the lower half, lightly draw diagonal lines pointing down, starting at the edges of the top part of the eye. The steepness of the slope of these lines will determine how large and wide the eye will be. If you look at the other tutorials in this application, you will see that the steepness of these lines varies. Using these lines as a guide, draw the lower part of the eye. It should slope down to the right a little, and should be thicker at the right corner.",
    },
    
    {
        "image" : "eyes1c",
        "width" : 1242,
        "height" : 864,
    },
    
    {
        "text" : "Erase the guidelines and draw a long oval within the eye. Some characters have large circles for irises, but this particular one has thin ovals. You can adjust the shape so it's wider, if you like. Make part of the oval obscured by the upper part of the eye. With all styles, the complete iris is rarely visible; part of it is almost always concealed by the upper part.",
    },
    
    {
        "image" : "eyes1d",
        "width" : 1242,
        "height" : 864,
    },
    
    {
        "text" : "Next, draw the outline of the light glares. Anime and manga characters' eyes should always have at least some sort of shading. Anime and manga females in particular tend to have really heavy shading and lots of shiny areas. Make sure you choose a light source, and stick with it throughout your picture. For example, since the light is coming from the left in this picture, we have to make sure all the highlights on the rest of the picture originate from the left, or the lighting will be inconsistent (unless we're using multiple light sources). Draw two long ovals: a large one on the left side of the iris (which overlaps the outline of the iris, as you can see), and a very small one on the other side of the eye.",
    },
    
    {
        "image" : "eyes1e",
        "width" : 1242,
        "height" : 864,
    },
    
    {
        "text" : "Now draw the pupil underneath the light glares. The highlights are always on top; never draw the pupil on top of the light glares. Draw the eyelashes, too; with this particular eye, the eyelashes are a series of spikes coming off of the top-right part of the eye. Make the spikes follow the curve of the eye, so it looks like they are coming off of the eye; don't just draw zig-zag lines sticking out of the eye. ^_~ Also, draw the eyelid on the left part of the eye. It should be a thin, curved line originating from the top of the eye.",
    },
    
    {
        "image" : "eyes2a",
        "width" : 1242,
        "height" : 597,
    },
    
    {
        "text" : "Okay, now we are going to draw another style, one that isn't as common. This eye is much more slender, elegant, and realistic looking, and is used in more serious anime and manga. This particular eye belongs to Deedlit from Record of Lodoss War, which is a considerably more serious show than Slayers (which is where the previous eye came from). Begin by drawing a long, slightly curved line. The left side should be lower than the right, and the line should curve in sharply at the left edge.",
    },
    
    {
        "image" : "eyes2b",
        "width" : 1242,
        "height" : 596,
    },
    
    {
        "text" : "To help you define the sides and bottom of the eye, lightly draw two diagonal guidelines that originate from the edges of the eye. Unlike the previous tutorial, these lines are not very steep; the more horizontal the lines are, the smaller the eye will be. Don't make them too flat, though, because you don't want this eye to be too squinty. Using the guidelines, draw the bottom line of the eye.",
    },
    
    {
        "image" : "eyes2c",
        "width" : 1242,
        "height" : 597,
    },
    
    {
        "text" : "Erase the guidelines and draw the outline of the iris. If there were no eyelids, the iris would be a perfect circle. However, since the iris is bordered by the eyelids, the top and bottom of the iris will be hidden from view. The iris should not be so small that you can see the entire thing (unless you wanted to convey certain emotions like anger or surprise, but that is covered in another section).",
    },
    
    {
        "image" : "eyes2d",
        "width" : 1242,
        "height" : 597,
    },
    
    {
        "text" : "Next, draw the light glares on the iris. The placement is the same as in the previous tutorial, but like the iris itself, the glares are much smaller and more circular. Draw the eyelid above the top line of the eye, as well.",
    },
    
    {
        "image" : "eyes2e",
        "width" : 1242,
        "height" : 745,
    },
    
    {
        "text" : "Draw the eyebrow and shading in the rest of the iris. Remember to draw the pupil beneath the light glares, and to make it stand out from the rest of the eye a little no matter how darkly you shade the rest of the iris.",
    },
    
    {
        "image" : "eyef",
        "width" : 1242,
        "height" : 1018,
    },
    
    {
        "text" : "Here are a variety of other styles of female eyes you can make using the same methods. Try to see the differences between each style, as well as the similarities. Though the shape and proportions change, the top border of the eyes is always thicker, there are always multiple layers of shading on the irises, etc.",
    },
    
]
