
[
    
    {
        "image" : "exp1a",
        "width" : 1242,
        "height" : 1242,
    },
    
    {
        "text" : "Changing the expression of anime and manga characters isn't particularly difficult, but it helps to know which features need to be adjusted for each type of emotion. In this tutorial, I will show you how the various parts of the face work together to convey different emotions. Once you learn what features to change to achieve the look you want, you should be able to draw any emotion you like. Please read through my other facial tutorials, though, since it helps to have a working knowledge of how the features should be aligned before you begin.\n\nFirst, we'll start off going over sadness, a fairly common emotion. This is a typical anime and manga face, but notice the changes that have been made. The most obvious indicator of the character's emotion, in this case, are the eyebrows. Notice how the inner tips of the eyebrows curve upwards. Also, her lower eyelids curve upward slightly, while her upper eyelids have a more large, round curve. Curving the lower eyelid can indicate stress, sorrow, or anger; in this case, the shape of the eyebrows shows us that it is sorrow. ^_^ Also, notice the shape of the mouth; it is small, and curves downward. Overall, the character looks like she's about to burst into tears.",
    },
    
    {
        "image" : "exp1b",
        "width" : 1242,
        "height" : 1242,
    },
    
    {
        "text" : "This form of sadness is more subdued. The character seems depressed, but not as sad as the previous example. The eyes are smaller here (partly because this is a guy ^_^), and the mouth is larger and does not curve down so far. The angle of the eyebrows and the arch of the lower eyelid still let you know that this character is upset about something.",
    },
    
    {
        "image" : "exp1c",
        "width" : 1242,
        "height" : 1242,
    },
    
    {
        "text" : "This picture is sort of a transition between sadness and anger. The eyebrows curve down sharply and his mouth is drawn so it looks like he is shouting, both of which indicates that he is mad, yet his irises are still very large. This sort of makes him look like he is angry, yet hurt or upset at someone or something.",
    },
    
    {
        "image" : "exp1d",
        "width" : 1242,
        "height" : 994,
    },
    
    {
        "text" : "This guy is clearly very ticked off, even though he isn't shouting. ^_~ You can draw angry people without them screaming their heads off. In this picture, the eyebrows are close to the eyes and angle down sharply (I also drew the folds in the skin caused by drawing one's eyebrows together like that), and the mouth angles downwards sharply. The eyes have been narrowed, and irises are very small, which helps to make a character look even more angry. ^_^",
    },
    
    {
        "image" : "exp1e",
        "width" : 1242,
        "height" : 1242,
    },
    
    {
        "text" : "I'm not sure about this one; he looks both confused and ticked off. Alternating the angles of the eyebrows like this indicates confusion or incredulity. To add to the expression, draw the mouth slightly off-center, as well.",
    },
    
    {
        "image" : "exp1f",
        "width" : 1242,
        "height" : 1242,
    },
    
    {
        "text" : "It's surprising how often anime and manga characters talk with their eyes closed... ^_^ I wonder how many people actually talk like that...? Anyway, closed eyes can express a variety of emotions. Here, they express impatience or annoyance, but they can also express calmness, happiness, or smugness. Flip the eyes around and have them curve upwards, and they can express extreme sadness, as well as excitement. For this particular picture, I made the eyebrows angle downwards and drew the mouth open. Notice how I drew the upper left lip slightly raised; this helps whatever emotion you are trying to convey seem more negative, whether you are drawing anger, unhappiness, or impatience. ^_^",
    },
    
    {
        "image" : "exp1g",
        "width" : 1242,
        "height" : 1242,
    },
    
    {
        "text" : "Happiness is one of the most common emotions you see with pictures of anime and manga characters. Excessive happiness or excitement can be expressed by large eyes, highly arched eyebrows, and a big smiling mouth. Other features such as extra shinies in the eyes and the upward curving of the lower eyelid are also common. On a side note, more kawaii characters tend to have huge eyes, and small noses and mouths (unless their mouth is open, as in this picture).",
    },
    
    {
        "image" : "exp1h",
        "width" : 1242,
        "height" : 1242,
    },
    
    {
        "text" : "This character is happy, as well, but not to the extent as in the previous example. The emotion is much more subtle. Notice that the eyebrows have been lowered (though they still arch slightly) and the curve of the mouth is very slight. The lower eyelids are arched, though, and the irises are still pretty large, so though the character's contentment is not as obvious, it is still clear he's in a good mood. ^_^",
    },
    
    {
        "image" : "exp1i",
        "width" : 1242,
        "height" : 1242,
    },
    
    {
        "text" : "To express surprise or shock, enlarge the eyes and make the pupils smaller. This is particularly apparent in anime and manga face faults, when a character is so suprised that his/her eyes become almost as large as the rest of the face... ^_^ In this particular example, the mouth is drawn really small, but other sizes will work too.",
    },
    
    {
        "image" : "exp1j",
        "width" : 1242,
        "height" : 1242,
    },
    
    {
        "text" : "This guy isn't particularly exciting; he just looks irritated. The irises are small, the eyebrows are arched down, and the mouth is small and slightly off center. I can't think of much else to say for this one... ^_^",
    },
    
]
