
[
    {
        "text" : "INTRODUCTION",
    },
    
    {
        "text" : "Are the eyes windows to the soul? Why, yes! That's right! The eyes are one of the most important features of a character, because they can show different personalities and expressions. However, we should begin with the most simple type, so today we will look at how to draw simple large round eyes!\n\nThere is no right or wrong way to draw manga eyes- some artists draw with less details and some with more. Large and round eyes are normally associated with young, cute, or gentle type characters.",
    },
    
    {
        "text" : "\nSTEP 1: OUTLINE - SHAPE AND SIZE",
    },
    
    {
        "image" : "STEP 1- OUTLINE - SHAPE AND SIZE ",
        "width" : 798,
        "height" : 411,
    },
    
    {
        "text" : "First, we start with the top line- this line determines the shape of the eye. Draw the lines curved downward as they reach the outer sides. To create those large and child-like eyes, be sure to make the outer corners round. Once you have gotten the shape that you want, draw the line at the bottom- this line determines the size of the eyes. However, you should make sure that the tips of the top lines match up with the tip of the bottom lines (refer to BLUE arrows in the diagram below). The lower lines are usually shorter and thinner than the upper lines.",
    },
    
    {
        "image" : "1_b_large",
        "width" : 480,
        "height" : 247,
    },
    
    {
        "text" : "The BLUE arrows show that the shape is determined by the top line- you can see that there is a clear roundness to the overall shape of the eyes. I also make sure that the top line is thicker than the bottom. However, there are artists who do not mind this particular detail too much and draw the upper and lower lines with the same thickness.\n\nNOTE: Personally, I like to draw with more sharp flaring lines at the inner and outer corners as indicated by the GREEN arrows. You can also draw them without the flare- many artists for Shonen Jump draw the eyes without the flares at the outer corner of the eyes, but instead, use smooth lines to complete the rounded corner.",
    },
    
    {
        "text" : "\nSTEP 2: IRIS - DIRECTION AND SIZE",
    },
    
    {
        "image" : "STEP 2- IRIS - DIRECTION AND SIZE",
        "width" : 600,
        "height" : 309,
    },
    
    {
        "text" : "Next, draw the iris - we will draw normal human iris here. The iris is usually circular or oval-shaped. The eyes drawn here are looking off to the side, which is why you can see more of a gap on the left side of each eye. When you are drawing eyes that look straight forward, the gap should be the same. Additionally, you want to make sure that the gaps under the iris are identical, otherwise the eyes will look uneven.\n\nNOTE: There are artists who draw the iris slightly angularly. However, they will still have an overall roundness to them.",
    },
    
    {
        "text" : "\nSTEP 3: IRIS - COLOR AND STYLE",
    },
    
    {
        "image" : "3j",
        "width" : 3078,
        "height" : 1286,
    },
    
    {
        "text" : "Now we will add the details inside the iris. You can see that there are a few different ways to detail the inside of the eyes, depending on the colors and design inside them. If the eye color is light, it is best to use ones with less black ink or screentones. For the next step, I will go with a normal human pupil (top left).\n\nMy main media is usually ink, whiteout, and screentone.\n\nYou can use the link below to download and print a blank eye template for practicing the iris details!",
    },
    
    {
        "text" : "\nSTEP 4: CREASE AND BROWS",
    },
    
    {
        "image" : "STEP 4- CREASE AND BROWS",
        "width" : 1300,
        "height" : 740,
    },
    
    {
        "text" : "Does the character have double eyelids (crease above the usual eyelids)? If yes, add a thin line above each eye- I personally tend to use 'Y-shape' lines because I think that they give the eyes more depth, but there are also times where I use single stroke lines. Be careful with the height this crease line, because the higher it goes, the more sleepy or unamused the character will look, as seen in the diagram above! So be careful! The types of folds here can be changed as you please. For example, the crease line can be steep or relatively flat.\n\nNOTE: The crease should change with the shape of the upper eyelids- if the eyelids are straight and flat, the crease lines tend to become flatter too.\n\nNext, we can add the eyebrows. Here, we will use normal and unexpressive eyebrows. You will have to choose the thickness of the eyebrows. Thin eyebrows are usually associated with youthfulness or femininity, while thicker eyebrows are more masculine, active, or head strong.",
    },
    
    {
        "text" : "\nSTEP 5: LASHES - MALE OR FEMALE?",
    },
    
    {
        "image" : "5a",
        "width" : 1300,
        "height" : 398,
    },

    {
        "text" : "Now there are two ways this can go, with or without lashes. Having lashes does NOT always mean that the character is female - some feminine male characters have lashes, too, and sometimes female characters are drawn without any lashes at all! On the left side, the character has no lashes, but given the round and downward-sloping shape of the eyes, this pair of lashes-less eyes work as female eyes too.\n\nOn the right, we have a pair of eyes that are clearly very feminine. But as mentioned before, eyelashes can be for boys, too! As you can see, the PURPLE and ORANGE lines indicate the directions of the lashes. The PURPLE lashes curve upward, while the ORANGE lashes curve downward.\n\nSince there are many ways to draw the lashes, I have drawn two additional styles of (lower) lashes for you.\n\nLASHES A - Start from the same point and flare outward.\n\nLASHES B - Start from different points and come together (I am using this one in the sample drawing).\n\nFeel free to experiment with lashes because it can make your character's eyes more dynamic.",
    },
    
    {
        "text" : "\nSTEP 6: DEPTH - SHADING",
    },
    
    {
        "image" : "2_grande",
        "width" : 600,
        "height" : 309,
    },
    
    {
        "text" : "This step is optional. Some artists do not like to use so much screentone because they want to keep their art simple, clear, and clean with lots of black and white spaces (and of course, screentones are expensive!!) But using screentone around the eyes can create various effects. In the example, I have added screentone and other shadings to indicate areas which will require more shading when strong light is flashed against the character's face. But if you have seen MU Days, I don't do this to every close up (it would simply take too long! Haha! Shh... don't tell anyone).",
    },
    
    {
        "text" : "CONCLUSION",
    },
    
    {
        "text" : "Now that we have covered all the steps, I encourage you to download and print our template for further practice!\n\nI hope that you found this tutorial useful and will continue to visit our page for future tutorials, books, webcomics, and much more!",
    },

    
]
