
[
    
    {
        "image" : "hair1a",
        "width" : 1242,
        "height" : 1345,
    },
    
    {
        "text" : "Depending on the style, anime hair can be very complex. However, if you break it down into its basic components, the process of drawing anime hair becomes a little simpler.\n\nLike real hair, anime hair is composed of many strands. However, rather than drawing each individual strand, the hair is often drawn in various sized/shaped clumps, as shown here. These are some of the simplest forms of each hair style. Notice that in most cases, the outline is more curvy on the bottom of the hair clump. This is especially apparent on the top leftmost example; the lower line is curvier than the top line, giving the hair more depth and more of that anime-ish look. Sometimes this is highly exaggerated, and other times it is hardly noticable, but for most anime hair styles, each individual strand of hair will have this basic shape.",
    },
    
    {
        "image" : "hair1b",
        "width" : 1242,
        "height" : 1376,
    },
    
    {
        "text" : "Once you know how to draw each strand/clump of hair, you can start putting them together to form more something that more resembles anime hair. Look at each example here (well, except maybe for that one on the lower left; I'm not sure why I left that in), and notice how the basic strands from the first step are used. The same similar shapes generally persist throughout many different hairstyles. Making one line curve out more than the other on each strand can really help to flesh it out.\n\nAnother thing to keep in mind is that you can make the hair as detailed as you like; just keep adding more strands. I'll go over this more shortly. ^_^",
    },
    
    {
        "image" : "hair1c",
        "width" : 1242,
        "height" : 1802,
    },
    
    {
        "text" : "Now, we are getting into some slightly more complex shapes. Notice how varying the size and shape of each strand gives the hair different character; the strands can be long and thin, thick and curvy, or sharp and spiky. Again, notice that you can either make the hair very detailed, or very simple, depending on how many individual strands you draw.",
    },
    
    {
        "image" : "hair1d",
        "width" : 1242,
        "height" : 1600,
    },
    
    {
        "text" : "Here are more examples of different basic shapes of hair. Take note of how the hair overlaps and is nested in itself when it bends or twists. You can make some really interesting hair by having it twist and turn all over the page. ^_^",
    },
    
    {
        "image" : "hair2a",
        "width" : 1242,
        "height" : 1567,
    },
    
    {
        "text" : "Next, I'm going to go over some different types of hair styles, but before I continue, I want to go over a few things regarding the placement of the hair on the head.\n\nNo matter what hairstyle you are going to draw, the hair always grows from the same region of the head, as shown by the example in the middle. It grows out from the entire back part of the scalp, from the forehead to the back of the neck (not just the base of the head, but down the back of the neck, too). It isn't just plopped onto the top of the head. You can generally get away with not paying attention to this fact, but if you are drawing hair that has been pulled back or hair that is trimmed really short, then it will be important that you know where exactly the hair is placed.\n\nOne recurring problem I've noticed with a variety of artists is that they do not take into account the fact that there is a skull underneath the hair. Sometimes artists draw the hair too small for the head, as in the example at the bottom. The bangs stick out, but there is no forehead beneath them; the hair curves down on the head far too low, cutting the head off and making the skull oddly shaped and flat. This is not a good thing. ^_~ If you need to, draw out the character's entire head before adding the hair, so that it will fit and look natural. Well, as natural as anime hair can look.. :D",
    },
    
    {
        "image" : "hair2b",
        "width" : 1242,
        "height" : 1709,
    },
    
    {
        "text" : "Okay, now that I've gotten that taken care of, here are some examples of different anime hairstyles, all with short hair. Hopefully it might give you some ideas. Notice also that many of these can be used for either male or female hairstyles. I'm sorry these aren't as detailed as some of the previous examples, but you still get the basic idea and shape of each style (hopefully).",
    },
    
    {
        "image" : "hair2c",
        "width" : 1242,
        "height" : 1709,
    },
    
    {
        "text" : "Here are some different examples of longer, flowing hair styles; again, some of these can be used for either male or female, so don't whine at me for only drawing hair for one gender.. ^_~\n\nIn contrast to the shorter hair styles, you'll note that a lot of these are composed of long, curving lines. When drawing longer hair, try to avoid making the lines perfectly straight; make sure that the hair follows the form of the head and the body, especially if it is sitting on or over the shoulders.\n\nWhen drawing longer hair, you'll especially want to make sure the lines follow the shape and flow of the hair, rather than have it simply fall down in straight lines regardless of the hair's shape. It will give your character's hair much more depth and form if you make your lines work for you; make them show that the hair turns and twists, not that it just sits there on the character's head, or that the main outline of the hair is curvy but the interior strands are all straight.",
    },
    
    {
        "image" : "hair2e",
        "width" : 1242,
        "height" : 1884,
    },
    
    {
        "image" : "hair2d",
        "width" : 1242,
        "height" : 1770,
    },
    
    {
        "text" : "Here are a few more examples of different hair styles, this time focusing on hair that has been pulled back in ponytails. I don't have much to say about it; I just thought that I should put these in their own section since I had so many of them drawn up. Just remember that when the hair is pulled in a specific direction, the lines and strands of the hair are drawn in that direction, too.",
    },
    
    {
        "image" : "hair3a",
        "width" : 1242,
        "height" : 1709,
    },
    
    {
        "text" : "Now, here is the tough part: putting your character's hair into motion. I'm going to start by going over some examples with long hair.\n\nAnime hair is often drawn whipping about dramatically in the wind; it may look difficult to draw at first, but it isn't that bad. First, decide which direction you want the hair to be blowing. Do you want the hair to move to the sides, to be blown back behind the character, or pushed forward in front of the character? Once you decide, draw the hair (all the hair; bangs move along with the rest of the hair) moving in that direction. It is similar to drawing the hair falling straight down the character's back, except now you are curving it in a different direction. The lines of the hair and each individual strand will be pulled in the direction that the entire mass of hair is being drawn. Remember to use curved lines that follow the form of the hair, not straight lines that simply go from one end to the other.\n\nFor example, on the topmost right picture, the character's hair is being swept back behind him; thus, I drew the hair curving back behind him in nice, sweeping lines. For some really nice examples of similar hairstyles, find some CLAMP manga such as Rayearth or X/1999; they're loaded with characters with beautiful, sweeping hair. ^__^ All these examples were borrowed from CLAMP's RG Veda, by the way (I was working on this tutorial in the library, and RG Veda was the only manga I had on me... ^_^;).",
    },
    
    {
        "image" : "hair3b",
        "width" : 1242,
        "height" : 1728,
    },
    
    {
        "text" : "Well, those examples are all well and good if you are drawing a character with really long hair, but what about shorter hair? Shorter hair can be easier, since there isn't as much of it to draw, but it can also be difficult because you sometimes have to pay more attention to each little strand. In these examples (again, borrowed from CLAMP :3 ), the characters all have shoulder-length hair, swooshing about in various directions.\n\nTake particular notice of the top example; the movement on the hair is slight, and thus not all of the strands are bent in the same direction. You don't have to have all the hair jutting out in one direction in order to indicate motion. In the bottom example, notice how having the strands not all move in exactly the same direction gives the hair an interesting floaty feel.\n\nIf you were drawing really really short hair, then the only motion that you would need to portray would be the bangs, or any other part of the hair that would be long enough to move in the wind. Naturally, if the hair is trimmed extremely close to the scalp, it won't be fluttering in the breeze. ^_~\n\nThus concludes my hair tutorial. Hope it's been of help! :) If there are hair styles that weren't covered, just go out and find some pictures to use as reference and do some studying on your own. ^_^\n\nAnd I know I didn't go over how to shade hair; you needn't remind me. Hopefully I'll be able to address that subject in the future, but I can't promise anything.",
    }
    
]
