[

    {
        "image" : "advice_male_bodies_001",
        "width" : 740,
        "height" : 749,
    },
    
    {
        "text" : "Drawing manga-style male characters can be a bit more challenging than drawing female characters because there are usually more choices you can make. But the basic approach is the same. You might already know that any anime/manga character is proportioned by counting the number of 'heads tall' they are. In other words, a chibi character will only be the height of 2 to 3 times the size of his or her head, and typical 'cartoony' manga characters are usually 5 to 7 heads tall. More realistic (and occasionally shoujo-style) characters are sometimes up to 8 heads tall. Keeping to these scales will assure your characters — male or female — look properly proportioned."
    },
    
    {
        "image" : "advice_male_bodies_002",
        "width" : 696,
        "height" : 750,
    },
    
    {
        "text" : "Another difference to be aware of is that female bodies tend to curve in at the stomach and flare out at the hips, and accentuating this is a sure giveaway that your character is a female. Males, on the other hand, have torsos that do not curve in much, and should even expand out if you're drawing a beefy or overweight character. Pay attention to the legs too — instead of drawing nice, curvy calves, you will want to use slightly more blocky shapes to add muscle, or simply draw the legs much skinnier and straighter (Monkey D. Luffy of One Piece is an extreme example). Also, male shoulders tend to be broader (they expand out farther from the head), and occasionally very muscular characters will have a neck that sort of expands out into the shoulders (any Dragon Ball Z character is a good example)."
    },
    
    {
        "image" : "advice_male_bodies_003",
        "width" : 613,
        "height" : 750,
    },
    
    {
        "text" : "This brings us to our final point: What kind of male character are you drawing? In manga, you seldom see female characters that aren't tall, thin and pretty, but male manga characters can run the gamut from being short and impish, to fat and ogreish, to tall and striking. Choose what image you want your character to project and really accentuate the physical attributes that convey that image. If he's a real geek, make him hunched over with his shoulders almost behind his head (like L from Death Note). If he's a dashing young man, give him an 8-head-tall figure with long, thin legs and a nice thin torso. The possibilities are endless, but trying to draw different kinds of figures is the best way to learn which kinds of bodies create various impressions."
    }
    
]
