
[
    
    {
        "image" : "01-Naruto",
        "text" : "Start off drawing Naruto by building up his form with basic shapes that you see. For example, his body can be seen as an oval, as well as his face…take a look at the picture above."
    },
    
    {
        "image" : "02-Naruto",
        "text" : "Now lets focus on his face…an oval shape. Draw guidelines around his face vertically and horizontally, as pictured above. This will help you correctly place his facial features. Now look at the picture above and recreate it on your piece of paper."
    },
    
    {
        "image" : "03-Naruto",
        "text" : "Now draw the top of his mouth. Draw his eyebrows (the one on the left looks like a checkmark). Draw outward turned lines a the right and left of each eye. Also draw 3 downwards turned lines on both sides of the face."
    },
    
    {
        "image" : "04-Naruto",
        "text" : "Now finish up the outer shape of the eye bny drawing a downwards curved line on the top. Draw Naruto’s top teeth. Draw both ears as letter ‘c’ shapes. Draw his headband as well."
    },
    
    {
        "image" : "05-Naruto",
        "text" : "Draw a circle within each eye. Draw a dot for the pupil and a circle for the highlight, on the bottom left of the eye. Draw the bottom teeth. Draw a backwards letter ‘J’ in the left ear and a letter ‘J’ within the right ear."
    },
    
    {
        "image" : "06-Naruto",
        "text" : "Lightly sketch a circle at the top of Naruto’s head. Now draw zig-zaggy line within this circle…then erase this circle"
    },
    
    {
        "image" : "07-Naruto",
        "text" : "Now draw zig-zaggy’s within the head, as pictured above. Draw zig-zaggy lines below the ear as well. Also draw a rectangle with curved outer corners within the headband. Draw 6 small circles at either end of this rectangle."
    },
    
    {
        "image" : "08-Naruto",
        "text" : "Draw the basic shapes that make up the Naruto symbol / logo – such as the triangle-ish shape … a backwards letter ‘c’ shape … and a curved letter ‘L’ like shape."
    },
    
    {
        "image" : "09-Naruto",
        "text" : "Now draw the basic shapes that make up his shirt … with rectangle / square like shapes. Draw 4 ovals on the left hand."
    },
    
    {
        "image" : "10-Naruto",
        "text" : "Now that you have the basic shapes of the shirt, draw the outlines of the shirt, and wrinkles. For the sleeves, make 2 ovals and then connect them, as you see on the right arm. For the left hand, draw the fingers over the ovals you drew in the last step."
    },
    
    {
        "image" : "11-Naruto",
        "text" : "Draw more of the shirt."
    },
    
    {
        "image" : "12-Naruto",
        "text" : "Here is a close up of the right hand…I made it in different colors so that you can see smaller shapes that make up the whole. In purple, do you see a capital letter ‘G’. In purple, do you see a backwards letter ‘y’ shape. In green, do you see a capital letter ‘T’? Then make 2 line for the arms that connect it to the hands."
    },
    
    {
        "image" : "13-Naruto",
        "text" : "Now draw the basic shapes that make up the pants legs…rectangles / squares."
    },
    
    {
        "image" : "14-Naruto",
        "text" : "Now draw the pants around these shapes…getting some wrinkles in there."
    },
    
    {
        "image" : "15-Naruto",
        "text" : "Draw some more wrinkles and draw the pants cuff."
    },
    
    {
        "image" : "16-Naruto",
        "text" : "Now start drawing the shoes."
    },
    
    {
        "image" : "17-Naruto",
        "text" : "Draw the toes on the left foot by drawing a bunch of ‘u’ type shapes. On the right foot, draw more of the shoe."
    },
    
    {
        "image" : "18-Naruto",
        "text" : "Draw the toes on the right foot – they are inwards curved lines. Draw curves on the left pants…patterns."
    },
    
    {
        "image" : "19-Naruto",
        "text" : "Now draw the zipper on the coat….wrinkles in between….zippers are made up of a bunch of squares. Draw 2 half circles around the neck."
    },
    
    {
        "image" : "20-Naruto",
        "text" : "Draw downwards curved lines on the top of the half circle and upwards curved line at the bottom half circle….draw lines in the middle."
    },
    
    {
        "image" : "21-Naruto",
        "text" : "Draw a spiral at the right of the headband."
    },
    
    {
        "image" : "22-Naruto",
        "text" : "Draw a cylinder shape – draw more."
    },
    {
        "image" : "Naruto",
        "text" : "Now just erase lines that you don’t need and outline the ‘correct’ lines with a black pen or marker. Making thick, interesting lines instead of the thin pencil lines makes quite a difference in the end result, doesn’t it? If you are having problems figuring out which lines to erase, then reference my drawing (above) for help. Now you will have an amazing cartoon drawing of Naruto to show off to your friends."
    }
]
