
[
    
    {
        "text" : "WHAT IS A “CHIBI”?\n\n“Chibi” is a Japanese word used to describe cartoon characters (and real people and animals) that are small in stature, which in turn makes them cute. In manga, chibi characters are also sometimes called “super-deformed characters,” or simply “SD.” (The popular “SD Gundam” manga and anime series, which features miniature robot characters, incorporates the abbreviated phrase right in its name.) Chibi are are often used for comic relief or to depict the lighthearted mood or atmosphere of a situation, and thus the smallish characters are drawn differently from their full-sized counterparts. The drawing below compares a regular-proportioned character with a chibi character. ",
    },
    
    {
        "image" : "chibi_tutorial_1a",
        "width" : 1080,
        "height" : 1009,
    },
    
    {
        "text" : "Chibi are often drawn as a standalone artwork, as the characters are quite cute and mascot-like. As you can see in the sample drawing above, there are clear differences between the full and chibi versions of the character, particularly the height and face shape. Chibi characters tend to be shortened and simplified versions of full-length characters.\n\n\nDRAWING A CHIBI\n\nSuper-deformed characters do not always have to be pint-sized — there is more than one way to draw a chibi. Some artists prefer to draw them short and round, while others draw them slightly taller and slimmer. The choice, of course, all depends on the taste and style of the artist. Beginners should try drawing chibi characters in all shapes and sizes to determine which type they like best.",
    },
    
    {
        "image" : "chibi_tutorial_2",
        "width" : 1080,
        "height" : 694,
    },
    
    {
        "text" : "The illustrations above show the different styles of chibi that an artist might use. The arrow indicates the degree of simplification.\n\n\n\nAlthough they are not the same character, the variations in height, width, proportion and style are quite apparent from one drawing the next. The one the left (of the legendary Monkey King, Son Goku) has proportions closest to that of a full-sized character. You can also see that details such as muscles, fingers and fingernails, along with folds in the clothes, are visible in this taller version of a chibi. The middle and right characters, on the other hand, are shorter and less realistically proportioned. Although their proportions are similar, you can see that the body of the middle chibi is rounder and fuller than the one on the right, which is slimmer.\n\nJust remember to come up with a style that works best for you!\n\n\n\nDON'T NEGLECT THE DETAILS\n\nMany beginners assume that chibi characters are less detailed than their full-sized counterparts, but this is not entirely true. Although some parts of the body are less detailed than non-SD characters, you should still be sure to include important details that are essential to your characters. If certain details are present in the full-sized character, they should be part of the chibi version too! Below is an example of a chibi character that is be just as rich in detail as the full-sized original. ",
    },
    
    {
        "image" : "chibi_tutorial_3a",
        "width" : 1080,
        "height" : 1000,
    },
    
    {
        "text" : "As you can see, the chibi version has just as many details as the larger character. Because this particular chibi is slightly taller rather than a truly miniaturized character, it’s somewhat easier to make the hair, hands, ears, clothes and body shape resemble those of the full-sized character. However, there are still elements of the chibi that have been simplified; for example, the face has been made rounder and in a simplified crescent shape, and details around the knees have been eliminated. Also note that the details magnified in the circles are almost identical from one character to the next.\n\n\n\nCONCLUSION\n\nThere is no one right way to draw chibi character; you must develop your own style, not only so you will stand out among other artists, but so you can personalize your art. Chibi characters can be short or tall; simplified or detailed; slim, round or even a mixture of this and that! Explore all types and experiment by combining different features to see what works best. But keep in mind that a wobbly doodle and a well-drawn chibi are not the same thing, so be sure to pay attention to details! Good luck, and don’t forget to have fun!",
    }
    
]
